Amiya200/stm32_water_tank/Core/Src/lora.c
/* ====================================================================
 * lora.c  —  RECEIVER LoRa driver  (WT1.1 motor-controller project)
 *
 * v3.3 — FIFO base-address bug fix
 *
 *  The previous version configured every modem register but never wrote
 *  RegFifoTxBaseAddr (0x0E) / RegFifoRxBaseAddr (0x0F).  After SX1278
 *  reset these default to 0x80 / 0x00, so the *modulator* read from
 *  FIFO[0x80..] when transmitting ACKs — even though we wrote the ACK
 *  payload at FIFO[0..len-1].  The radio sent valid LoRa frames with
 *  random bytes, the TX received them, the parser rejected them, and
 *  the handshake never completed.  Fix: write both base-addr regs to 0
 *  during init.  This matches Semtech's own reference driver.
 *
 * Other improvements:
 *   • Read RegVersion (0x42) at boot and print it — if it's not 0x12
 *     the SPI link to the LoRa module is broken (wrong pins, bad solder,
 *     module unpowered, etc.). This is the FIRST thing to check.
 *   • Proper FSK→LoRa-sleep transition before mode change
 *   • Auto-pair on first valid packet (HELLO or TL)
 *   • Deferred logging — UART output happens AFTER ACK is on air
 * ==================================================================== */

#include "lora.h"
#include "lora_parser.h"
#include "device_id.h"
#include "stm32f1xx_hal.h"
#include "led.h"
#include <string.h>
#include <stdio.h>
#include <stdarg.h>
#include <stdbool.h>

extern SPI_HandleTypeDef  hspi1;
extern UART_HandleTypeDef huart1;

/* ── UART helpers ───────────────────────────────────────────────────── */
static void uart_print_now(const char *s)
{
    HAL_UART_Transmit(&huart1, (uint8_t *)s, (uint16_t)strlen(s), 1000);
    HAL_UART_Transmit(&huart1, (uint8_t *)"\r\n", 2, 1000);
}

/* ── Deferred log ring — flushed AFTER ACK is on air ───────────────── */
#define DEFER_LOG_LINES   8
#define DEFER_LOG_LEN     128
static char    s_deferLog[DEFER_LOG_LINES][DEFER_LOG_LEN];
static uint8_t s_deferHead  = 0;
static uint8_t s_deferCount = 0;
static LoRa_DiscoveredDevice_t s_discovered[LORA_DISCOVERY_MAX];
static uint8_t s_discoveredCount = 0;
static void log_defer(const char *fmt, ...)
{
    if (s_deferCount >= DEFER_LOG_LINES) return;
    va_list ap;
    va_start(ap, fmt);
    vsnprintf(s_deferLog[s_deferHead], DEFER_LOG_LEN, fmt, ap);
    va_end(ap);
    s_deferHead = (uint8_t)((s_deferHead + 1u) % DEFER_LOG_LINES);
    s_deferCount++;
}

static void log_flush(void)
{
    while (s_deferCount > 0)
    {
        uint8_t idx = (uint8_t)((s_deferHead - s_deferCount + DEFER_LOG_LINES)
                                % DEFER_LOG_LINES);
        uart_print_now(s_deferLog[idx]);
        s_deferCount--;
    }
}

/* ── Debug buffers for Live Expressions ─────────────────────────────── */
volatile char g_lastRxPacket[MAX_PACKET_LEN] = {0};
volatile char g_lastTxPacket[MAX_PACKET_LEN] = {0};

/* ── Public globals ─────────────────────────────────────────────────── */
uint8_t  loraMode            = LORA_MODE_RECEIVER;
uint8_t  g_loraConnected     = 0;
bool     g_loraNewPacketFlag = false;
uint32_t g_lora_tx_ok = 0, g_lora_tx_retry = 0, g_lora_tx_fail = 0;

/* ── Private state ──────────────────────────────────────────────────── */
static LoRa_ConnState_t s_state = LORA_STATE_DISCONNECTED;

static uint8_t  s_rxBuf[LORA_BUF_SIZE];
static uint32_t s_rxPacketCount = 0;

static uint8_t  s_wirelessLevel       = 0;
static uint8_t  s_wirelessWellDry     = 0;
static uint32_t s_wirelessLastRxTick  = 0;
static bool     s_wirelessDataValid   = false;

static uint32_t s_lastSeq            = 0;
static bool     s_seqInitialized     = false;
static uint32_t s_packetsLost        = 0;
static uint32_t s_duplicatePackets   = 0;
static uint32_t s_outOfOrderPackets  = 0;
#define LORA_CLEAR_PAIRING_ONCE  0   /* Set 1 once, flash, then set 0 */
#define LORA_DIO_DEBUG_ENABLE    1
static bool     s_pairingMode        = false;
static uint32_t s_pairingDeadline    = 0;
static bool     s_pairingDone        = false;
static uint32_t s_lastPairedDID      = 0;

static uint32_t s_lastSyncReqTick    = 0;
static uint32_t s_lastStatsTick      = 0;
static uint32_t s_lastPeerTick       = 0;

#define NSS_LOW()   HAL_GPIO_WritePin(LORA_NSS_PORT, LORA_NSS_PIN, GPIO_PIN_RESET)
#define NSS_HIGH()  HAL_GPIO_WritePin(LORA_NSS_PORT, LORA_NSS_PIN, GPIO_PIN_SET)

/* ── SX1276 register addresses (only the ones we touch) ────────────── */
#define REG_OPMODE              0x01
#define REG_FIFO                0x00
#define REG_FIFO_ADDR_PTR       0x0D
#define REG_FIFO_TX_BASE_ADDR   0x0E   /* ← THE FIX */
#define REG_FIFO_RX_BASE_ADDR   0x0F   /* ← THE FIX */
#define REG_FIFO_RX_CURRENT     0x10
#define REG_IRQ_FLAGS           0x12
#define REG_RX_NB_BYTES         0x13
#define REG_PKT_RSSI_VALUE      0x1A
#define REG_VERSION             0x42

/* ── SPI primitives ─────────────────────────────────────────────────── */

void LoRa_WriteReg(uint8_t addr, uint8_t data)
{
    uint8_t tx[2];

    tx[0] = addr | 0x80u;
    tx[1] = data;

    NSS_LOW();
    HAL_SPI_Transmit(&hspi1, tx, 2, HAL_MAX_DELAY);
    NSS_HIGH();
}

uint8_t LoRa_ReadReg(uint8_t addr)
{
    uint8_t tx[2];
    uint8_t rx[2];

    tx[0] = addr & 0x7Fu;
    tx[1] = 0x00u;

    rx[0] = 0x00u;
    rx[1] = 0x00u;

    NSS_LOW();
    HAL_SPI_TransmitReceive(&hspi1, tx, rx, 2, HAL_MAX_DELAY);
    NSS_HIGH();

    return rx[1];
}

static void LoRa_WriteBuffer(uint8_t addr, const uint8_t *buf, uint8_t size)
{
    uint8_t a = addr | 0x80u;

    NSS_LOW();
    HAL_SPI_Transmit(&hspi1, &a, 1, HAL_MAX_DELAY);
    HAL_SPI_Transmit(&hspi1, (uint8_t *)buf, size, HAL_MAX_DELAY);
    NSS_HIGH();
}

static void LoRa_ReadBuffer(uint8_t addr, uint8_t *buf, uint8_t size)
{
    uint8_t a = addr & 0x7Fu;

    NSS_LOW();
    HAL_SPI_Transmit(&hspi1, &a, 1, HAL_MAX_DELAY);
    HAL_SPI_Receive(&hspi1, buf, size, HAL_MAX_DELAY);
    NSS_HIGH();
}
/* ── Mode helpers ───────────────────────────────────────────────────── */
static void LoRa_Reset(void)
{
    /*
     * SX127x reset:
     * Pull RESET low, then release high.
     */
    HAL_GPIO_WritePin(LORA_RESET_PORT, LORA_RESET_PIN, GPIO_PIN_SET);
    HAL_Delay(10);

