Amiya200/stm32_water_tank/Core/Src/lora.c
    HAL_GPIO_WritePin(LORA_RESET_PORT, LORA_RESET_PIN, GPIO_PIN_RESET);
    HAL_Delay(10);

    HAL_GPIO_WritePin(LORA_RESET_PORT, LORA_RESET_PIN, GPIO_PIN_SET);
    HAL_Delay(20);
}
static void LoRa_EnterRxContinuous(void)
{
    LoRa_WriteReg(REG_IRQ_FLAGS, 0xFF);
    LoRa_WriteReg(REG_FIFO_ADDR_PTR, 0x00);

    for (uint8_t i = 0; i < 5; i++)
    {
        LoRa_WriteReg(REG_OPMODE, 0x85);
        HAL_Delay(2);

        if (LoRa_ReadReg(REG_OPMODE) == 0x85)
        {
            return;
        }
    }

    uart_print_now("[LORA RX] ERROR: failed to enter RX continuous 0x85");
}

/* ── Non-blocking poll of DIO0 ──────────────────────────────────────── */
static uint8_t LoRa_PollPacket(uint8_t *buffer, int16_t *rssi_out)
{
    uint8_t irq = LoRa_ReadReg(REG_IRQ_FLAGS);

    /*
     * Do not depend on DIO0 only.
     * Some boards show DIO0 stuck HIGH/LOW, so IRQ register is more reliable.
     */
    if ((irq & 0x40u) == 0u)   /* RxDone not set */
    {
        if (irq & 0x20u)       /* CRC error */
        {
            LoRa_WriteReg(REG_IRQ_FLAGS, 0x20u);
        }
        return 0;
    }

    if (irq & 0x20u)
    {
        LoRa_WriteReg(REG_IRQ_FLAGS, 0xFF);
        return 0;
    }

    uint8_t len = LoRa_ReadReg(REG_RX_NB_BYTES);

    if (len == 0u || len >= (LORA_BUF_SIZE - 1u))
    {
        LoRa_WriteReg(REG_IRQ_FLAGS, 0xFF);
        return 0;
    }

    uint8_t fifoAddr = LoRa_ReadReg(REG_FIFO_RX_CURRENT);
    LoRa_WriteReg(REG_FIFO_ADDR_PTR, fifoAddr);

    LoRa_ReadBuffer(REG_FIFO, buffer, len);
    buffer[len] = '\0';

    LoRa_WriteReg(REG_IRQ_FLAGS, 0xFF);

    if (rssi_out != NULL)
    {
        *rssi_out = (int16_t)(-157 + (int16_t)LoRa_ReadReg(REG_PKT_RSSI_VALUE));
    }

    return len;
}

/* ── Critical-path TX — send reply, then immediately back to RX ────── *
 * NO HAL_Delay here.  Every ms costs the ACK window.
 * ──────────────────────────────────────────────────────────────────── */
static void LoRa_FastReply(const char *pkt, uint8_t len)
{
    if (pkt == NULL || len == 0u || len >= LORA_BUF_SIZE) return;

    /* Mirror to debug buffer for Live Expressions                      */
    if (len < MAX_PACKET_LEN)
    {
        memcpy((void *)g_lastTxPacket, pkt, len);
        g_lastTxPacket[len] = '\0';
    }

    LoRa_WriteReg(REG_OPMODE,        0x81);  /* LoRa standby            */
    /* FifoTxBaseAddr is already 0 (set in init) — modulator will read
     * from FIFO[0..len-1] which is exactly where we write below.       */
    LoRa_WriteReg(REG_FIFO_ADDR_PTR, 0x00);
    LoRa_WriteBuffer(REG_FIFO, (const uint8_t *)pkt, len);
    LoRa_WriteReg(0x22, len);                /* RegPayloadLength        */
    LoRa_WriteReg(REG_IRQ_FLAGS,     0xFF);
    LoRa_WriteReg(REG_OPMODE,        0x83);  /* LoRa TX                 */

    uint32_t t0 = HAL_GetTick();
    while ((LoRa_ReadReg(REG_IRQ_FLAGS) & 0x08u) == 0u)
    {
        if ((HAL_GetTick() - t0) > LORA_TX_TIMEOUT_MS) break;
    }
    LoRa_WriteReg(REG_IRQ_FLAGS, 0x08u);

    LoRa_EnterRxContinuous();
}

/* ── Reply builders → wire ──────────────────────────────────────────── */
static void send_ack(uint32_t did)
{
    char buf[24];
    int n = LoRa_BuildAck(buf, sizeof(buf), did);
    if (n > 0) LoRa_FastReply(buf, (uint8_t)n);
}

static void send_pong(uint32_t did, uint32_t seq)
{
    char buf[32];
    int n = LoRa_BuildPong(buf, sizeof(buf), did, seq);
    if (n > 0) LoRa_FastReply(buf, (uint8_t)n);
}

static void send_reject(uint32_t did)
{
    char buf[24];
    int n = LoRa_BuildReject(buf, sizeof(buf), did);
    if (n > 0) LoRa_FastReply(buf, (uint8_t)n);
}

static void send_sync_req(void)
{
    char buf[24];
    int n = LoRa_BuildSyncReq(buf, sizeof(buf), DeviceID_GetOwn());
    if (n > 0) LoRa_FastReply(buf, (uint8_t)n);
}

/* ── State helpers ──────────────────────────────────────────────────── */
const char *LoRa_GetStateString(void)
{
    switch (s_state)
    {
        case LORA_STATE_DISCONNECTED: return "WAITING";
        case LORA_STATE_HANDSHAKING : return "HANDSHAKING";
        case LORA_STATE_CONNECTED   : return "CONNECTED";
        case LORA_STATE_STALE       : return "STALE";
        default                     : return "?";
    }
}

LoRa_ConnState_t LoRa_GetState(void) { return s_state; }

static void set_state(LoRa_ConnState_t ns)
{
    if (s_state == ns) return;
    s_state = ns;
    g_loraConnected = (ns == LORA_STATE_CONNECTED) ? 1u : 0u;
    log_defer("[LORA RX] STATE -> %s", LoRa_GetStateString());
}

/* ── Pairing logic (auto-pair when list empty) ─────────────────────── */
static bool already_in_list(uint32_t did)
{
    uint8_t cnt = PairedDev_Count();

    for (uint8_t i = 0; i < cnt; i++)
    {
        if (PairedDev_Get(i) == did)
            return true;
    }

    return false;
}

static bool should_allow(uint32_t did)
{
    if (!LoRa_DID_IsValid(did))
        return false;

    /*
     * Pairing mode only means "allow for discovery".
     * Actual storing happens only when user selects DID from LCD.
     */
    if (s_pairingMode)
        return true;

    /*
     * Normal mode:
     * only paired transmitter packet is allowed.
     * Any other DID will be ignored/rejected.
     */
    return PairedDev_IsAllowed(did);
}

void LoRa_ClearDiscoveredDevices(void)
{
    memset(s_discovered, 0, sizeof(s_discovered));
    s_discoveredCount = 0;
}

static void discovery_add_or_update(uint32_t did, int16_t rssi)
{
    if (!LoRa_DID_IsValid(did))
        return;

    /*
     * Already paired device should not be shown again in available list.
     */
    if (already_in_list(did))
        return;

    uint32_t now = HAL_GetTick();

    for (uint8_t i = 0; i < s_discoveredCount; i++)
    {
        if (s_discovered[i].valid && s_discovered[i].did == did)
        {
            s_discovered[i].rssi     = rssi;
            s_discovered[i].lastSeen = now;
            return;
        }
    }

    if (s_discoveredCount < LORA_DISCOVERY_MAX)
    {
        s_discovered[s_discoveredCount].did      = did;
        s_discovered[s_discoveredCount].rssi     = rssi;
        s_discovered[s_discoveredCount].lastSeen = now;
        s_discovered[s_discoveredCount].valid    = true;
        s_discoveredCount++;
    }
}

