Amiya200/stm32_water_tank/Core/Src/lora.c
uint8_t LoRa_GetDiscoveredCount(void)
{
    return s_discoveredCount;
}

bool LoRa_GetDiscoveredDevice(uint8_t index, LoRa_DiscoveredDevice_t *out)
{
    if (out == NULL)
        return false;

    if (index >= s_discoveredCount)
        return false;

    if (!s_discovered[index].valid)
        return false;

    *out = s_discovered[index];
    return true;
}

static void pair_device(uint32_t did)
{
    if (!LoRa_DID_IsValid(did))
        return;

    s_lastPairedDID = did;

    if (already_in_list(did))
    {
        s_pairingDone    = true;
        s_pairingMode    = false;
        s_seqInitialized = false;
        s_lastSeq        = 0;
        return;
    }

    if (PairedDev_Add(did))
    {
        s_pairingDone    = true;
        s_pairingMode    = false;
        s_seqInitialized = false;
        s_lastSeq        = 0;

        log_defer("[LORA RX] *** PAIRED DID %08lX (%u in list) ***",
                  (unsigned long)did,
                  (unsigned)PairedDev_Count());
    }
    else
    {
        log_defer("[LORA RX] PairedDev_Add failed");
    }
}

bool LoRa_PairDiscoveredDevice(uint8_t index)
{
    if (index >= s_discoveredCount)
        return false;

    if (!s_discovered[index].valid)
        return false;

    uint32_t did = s_discovered[index].did;

    pair_device(did);

    s_pairingDone   = true;
    s_pairingMode   = false;
    s_lastPairedDID = did;

    LoRa_ClearDiscoveredDevices();

    LoRa_WriteReg(REG_IRQ_FLAGS, 0xFF);
    LoRa_EnterRxContinuous();

    return true;
}

void LoRa_EnterPairingMode(void)
{
    LoRa_ClearDiscoveredDevices();

    s_pairingMode      = true;
    s_pairingDone      = false;
    s_lastPairedDID    = 0;
    s_pairingDeadline  = HAL_GetTick() + RX_PAIRING_TIMEOUT_MS;

    s_wirelessDataValid = false;
    s_seqInitialized    = false;
    s_lastSeq           = 0;

    set_state(LORA_STATE_DISCONNECTED);

    LoRa_WriteReg(REG_IRQ_FLAGS, 0xFF);
    LoRa_EnterRxContinuous();

    uart_print_now("[LORA RX] *** MANUAL PAIRING DISCOVERY ACTIVE ***");
    LED_SetIntent(LED_COLOR_BLUE, LED_MODE_BLINK, 200);
}

void LoRa_ExitPairingMode(void)
{
    s_pairingMode = false;
    LoRa_ClearDiscoveredDevices();

    LoRa_WriteReg(REG_IRQ_FLAGS, 0xFF);
    LoRa_EnterRxContinuous();
}

bool LoRa_IsPairingMode(void)
{
    return s_pairingMode;
}

bool LoRa_IsPairingComplete(void)
{
    return s_pairingDone;
}

uint32_t LoRa_GetLastPairedDID(void)
{
    return s_lastPairedDID;
}/* ── Wireless data accessors ────────────────────────────────────────── */
uint8_t  LoRa_GetWirelessTankLevel(void) { return s_wirelessLevel;   }
uint8_t  LoRa_GetWirelessWellDry  (void) { return s_wirelessWellDry; }
uint32_t LoRa_GetLastSequence     (void) { return s_lastSeq;         }
uint32_t LoRa_GetPacketsLost      (void) { return s_packetsLost;     }

bool LoRa_IsWirelessDataValid(void)
{
    if (!s_wirelessDataValid)
        return false;

    /* If no transmitter is paired, wireless data must never drive ADC */
    if (PairedDev_Count() == 0u)
    {
        LoRa_ClearWirelessData();
        return false;
    }

    if ((HAL_GetTick() - s_wirelessLastRxTick) > RX_PEER_TIMEOUT_MS)
    {
        s_wirelessDataValid = false;
        s_wirelessWellDry   = 0;

        if (s_state == LORA_STATE_CONNECTED)
        {
            set_state(LORA_STATE_STALE);
            uart_print_now("[LORA RX] !!! peer timeout — STALE");
            LED_SetIntent(LED_COLOR_RED, LED_MODE_BLINK, 500);
            s_seqInitialized = false;
        }

        return false;
    }

    return true;
}


void LoRa_OnPairingListChanged(void)
{
    /*
     * Called after user removes any paired transmitter.
     * This guarantees removed TX data cannot keep updating receiver ADC.
     */

    LoRa_ClearWirelessData();

    s_pairingMode      = false;
    s_pairingDone      = false;
    s_lastPairedDID    = 0;
    s_lastPeerTick     = 0;
    s_lastSyncReqTick  = 0;

    LoRa_ClearDiscoveredDevices();

    LoRa_WriteReg(REG_IRQ_FLAGS, 0xFF);
    LoRa_EnterRxContinuous();

    if (PairedDev_Count() == 0u)
    {
        uart_print_now("[LORA RX] No TX paired — using LOCAL ADC only");
        LED_SetIntent(LED_COLOR_PURPLE, LED_MODE_STEADY, 1);
    }
    else
    {
        uart_print_now("[LORA RX] Pairing list changed — waiting only for saved TX");
        LED_SetIntent(LED_COLOR_PURPLE, LED_MODE_STEADY, 1);
    }
}

/* ── Sequence validation ────────────────────────────────────────────── */
static bool validate_sequence(uint32_t newSeq)
{
    if (!s_seqInitialized)
    {
        s_lastSeq        = newSeq;
        s_seqInitialized = true;
        return true;
    }

    if (newSeq == s_lastSeq)
    {
        s_duplicatePackets++;
        log_defer("[LORA RX] dup seq %08lX", (unsigned long)newSeq);
        return false;
    }

    if (newSeq < s_lastSeq)
    {
        if ((s_lastSeq - newSeq) > 0x10000UL)
        {
            log_defer("[LORA RX] seq jumped back — TX restarted, resync");
            s_lastSeq        = newSeq;
            s_seqInitialized = true;
            return true;
        }
        s_outOfOrderPackets++;
        return false;
    }

    if (newSeq > s_lastSeq + 1u)
    {
        uint32_t lost = newSeq - (s_lastSeq + 1u);
        s_packetsLost += lost;
        log_defer("[LORA RX] gap: lost %lu pkt(s)", (unsigned long)lost);
    }

    s_lastSeq = newSeq;
    return true;
}

static void accept_data(uint8_t lvl, uint8_t wd, uint32_t did)
{
    /*
     * Hard gate:
     * Only saved paired transmitter can update wireless ADC source.
     * Removed / unknown / unpaired transmitter packets are ignored.
     */
    if (PairedDev_Count() == 0u || !PairedDev_IsAllowed(did))
    {
        LoRa_ClearWirelessData();

        log_defer("[LORA RX] blocked data from unpaired/removed DID=%08lX",
                  (unsigned long)did);
        return;
    }

    s_wirelessLevel      = lvl;
    s_wirelessWellDry    = wd;
    s_wirelessLastRxTick = HAL_GetTick();
    s_wirelessDataValid  = true;
    s_lastPeerTick       = HAL_GetTick();
    g_loraNewPacketFlag  = true;

