Amiya200/stm32_water_tank/Core/Src/lora.c
    if (s_state != LORA_STATE_CONNECTED)
        set_state(LORA_STATE_CONNECTED);
}

void LoRa_Init(void)
{
    char dbg[160];

    uart_print_now("");
    uart_print_now("=========================================");
    uart_print_now("  HELONIX RX  —  LoRa long-range init");
    uart_print_now("=========================================");

    DeviceID_Init();
    PairedDev_Init();

#if LORA_CLEAR_PAIRING_ONCE
    /*
     * TEMPORARY:
     * Your EEPROM currently has receiver's own DID as paired DID.
     * Clear it once so RX can auto-pair with transmitter.
     *
     * After one successful boot, set LORA_CLEAR_PAIRING_ONCE to 0
     * and flash again.
     */
    uart_print_now("[LORA RX] TEMP: clearing paired device EEPROM...");
    PairedDev_Clear();
    HAL_Delay(20);
    PairedDev_Init();
#endif

    char myDIDstr[9];
    DeviceID_GetHex(myDIDstr);

    snprintf(dbg, sizeof(dbg), "[LORA RX] My DID : %s", myDIDstr);
    uart_print_now(dbg);

    snprintf(dbg, sizeof(dbg),
             "[LORA RX] Paired : %u device(s) in EEPROM",
             (unsigned)PairedDev_Count());
    uart_print_now(dbg);

    if (PairedDev_Count() == 0u)
    {
        uart_print_now("[LORA RX] List empty — AUTO-PAIR first valid HELLO/TL");
    }
    else
    {
        for (uint8_t i = 0; i < PairedDev_Count(); i++)
        {
            snprintf(dbg, sizeof(dbg),
                     "[LORA RX]   [%u] DID %08lX",
                     i,
                     (unsigned long)PairedDev_Get(i));
            uart_print_now(dbg);
        }
    }

    /* Hardware reset and SPI diagnostic */
    NSS_HIGH();
    HAL_Delay(20);

    LoRa_Reset();
    HAL_Delay(20);

    uint8_t ver1 = LoRa_ReadReg(REG_VERSION);
    HAL_Delay(2);
    uint8_t ver2 = LoRa_ReadReg(REG_VERSION);
    HAL_Delay(2);
    uint8_t ver3 = LoRa_ReadReg(REG_VERSION);

    uint8_t ver = ver3;

    snprintf(dbg, sizeof(dbg),
             "[LORA RX] RegVersion reads: 0x%02X 0x%02X 0x%02X",
             ver1, ver2, ver3);
    uart_print_now(dbg);

    snprintf(dbg, sizeof(dbg),
             "[LORA RX] RegVersion(0x42)=0x%02X  (expected 0x12)",
             ver);
    uart_print_now(dbg);

    if (ver != 0x12)
    {
        uart_print_now("[LORA RX] *** SPI LINK BROKEN — radio cannot be reached ***");
        uart_print_now("[LORA RX] Meaning:");
        uart_print_now("[LORA RX]   0xFF = NSS/MISO floating or chip not selected");
        uart_print_now("[LORA RX]   0x00 = MISO low, reset/power/wiring issue");
        uart_print_now("[LORA RX] Check: NSS PA15, SCK PB3, MISO PB4, MOSI PB5, RESET PB6");
        uart_print_now("[LORA RX]        module power 3.3V, GND, soldering, Ra-02 orientation.");
    }

    /*
     * SX127x mode transition:
     * FSK sleep -> LoRa sleep.
     */
    LoRa_WriteReg(REG_OPMODE, 0x00);
    HAL_Delay(2);

    LoRa_WriteReg(REG_OPMODE, 0x80);
    HAL_Delay(10);

    /* Frequency: 433 MHz */
    uint64_t frf = ((uint64_t)433000000ULL << 19) / 32000000ULL;
    LoRa_WriteReg(0x06, (uint8_t)(frf >> 16));
    LoRa_WriteReg(0x07, (uint8_t)(frf >> 8));
    LoRa_WriteReg(0x08, (uint8_t)(frf));

    /* Preamble */
    LoRa_WriteReg(0x20, LORA_PREAMBLE_MSB);
    LoRa_WriteReg(0x21, LORA_PREAMBLE_LSB);

    /* PA config */
    LoRa_WriteReg(0x09, LORA_REG_PA_CONFIG);
    LoRa_WriteReg(0x0B, LORA_REG_OCP);
    LoRa_WriteReg(0x4D, LORA_REG_PA_DAC);

    /* Modem config */
    LoRa_WriteReg(0x1D, LORA_REG_MODEM_CFG1);
    LoRa_WriteReg(0x1E, LORA_REG_MODEM_CFG2);
    LoRa_WriteReg(0x26, LORA_REG_DETECT_OPT);
    LoRa_WriteReg(0x39, LORA_SYNC_WORD);

    /* FIFO base address fix */
    LoRa_WriteReg(REG_FIFO_TX_BASE_ADDR, 0x00);
    LoRa_WriteReg(REG_FIFO_RX_BASE_ADDR, 0x00);
    LoRa_WriteReg(REG_FIFO_ADDR_PTR,     0x00);

    /* Clear all IRQ flags */
    LoRa_WriteReg(REG_IRQ_FLAGS, 0xFF);

    uint8_t v_tx = LoRa_ReadReg(REG_FIFO_TX_BASE_ADDR);
    uint8_t v_rx = LoRa_ReadReg(REG_FIFO_RX_BASE_ADDR);
    uint8_t v_op = LoRa_ReadReg(REG_OPMODE);

    snprintf(dbg, sizeof(dbg),
             "[LORA RX] Verify: OpMode=0x%02X TxBase=0x%02X RxBase=0x%02X",
             v_op, v_tx, v_rx);
    uart_print_now(dbg);

    /* Enter RX continuous */
    LoRa_EnterRxContinuous();
    HAL_Delay(5);

    uint8_t v_op2 = LoRa_ReadReg(REG_OPMODE);

    snprintf(dbg, sizeof(dbg),
             "[LORA RX] OpMode after EnterRxContinuous: 0x%02X (want 0x85)",
             v_op2);
    uart_print_now(dbg);

    /* Reset software state */
    s_state              = LORA_STATE_DISCONNECTED;
    g_loraConnected      = 0;
    g_loraNewPacketFlag  = false;

    s_rxPacketCount      = 0;
    s_seqInitialized     = false;
    s_lastSeq            = 0;
    s_packetsLost        = 0;
    s_duplicatePackets   = 0;
    s_outOfOrderPackets  = 0;

    s_wirelessDataValid  = false;
    s_wirelessLevel      = 0;
    s_wirelessWellDry    = 0;
    s_wirelessLastRxTick = 0;

    s_pairingMode        = false;
    s_pairingDone        = false;
    s_lastPairedDID      = 0;

    s_lastSyncReqTick    = 0;
    s_lastStatsTick      = HAL_GetTick();
    s_lastPeerTick       = 0;

    memset((void *)g_lastRxPacket, 0, sizeof(g_lastRxPacket));
    memset((void *)g_lastTxPacket, 0, sizeof(g_lastTxPacket));

    uart_print_now("[LORA RX] Init complete — listening for transmitter...");
    LED_SetIntent(LED_COLOR_PURPLE, LED_MODE_STEADY, 1);
}
/* ── Periodic STALE handling ────────────────────────────────────────── */
static void handle_stale_periodics(uint32_t now)
{
    if (s_state != LORA_STATE_STALE) return;

    if ((now - s_lastSyncReqTick) >= RX_SYNC_REQ_INTERVAL_MS)
    {
        s_lastSyncReqTick = now;
        send_sync_req();
        uart_print_now("[LORA RX] STALE — sent @SY (waiting for TX HELLO)");
    }
}
void LoRa_ClearWirelessData(void)
{
    s_wirelessLevel      = 0;
    s_wirelessWellDry    = 0;
    s_wirelessDataValid  = false;
    s_wirelessLastRxTick = 0;
    s_lastSeq            = 0;
    s_seqInitialized     = false;
    g_loraConnected      = 0;
    set_state(LORA_STATE_DISCONNECTED);
}
/* ── Per-cycle stats (every 30 s) ───────────────────────────────────── */
static void maybe_print_stats(uint32_t now)
{
    if ((now - s_lastStatsTick) < 30000UL) return;
    s_lastStatsTick = now;

