Amiya200/stm32_water_tank/Core/Src/lora.c
    char dbg[160];
    snprintf(dbg, sizeof(dbg),
             "[LORA RX] stats rx=%lu lost=%lu dup=%lu lvl=%u%% wd=%u "
             "state=%s paired=%u",
             (unsigned long)s_rxPacketCount,
             (unsigned long)s_packetsLost,
             (unsigned long)s_duplicatePackets,
             (unsigned)s_wirelessLevel,
             (unsigned)s_wirelessWellDry,
             LoRa_GetStateString(),
             (unsigned)PairedDev_Count());
    uart_print_now(dbg);
}

void LoRa_Task(void)
{
    if (loraMode != LORA_MODE_RECEIVER)
        return;

    uint32_t now = HAL_GetTick();

#if LORA_DIO_DEBUG_ENABLE
    static uint32_t lastDioDebugTick = 0;

    if ((now - lastDioDebugTick) >= 2000UL)
    {
        lastDioDebugTick = now;

        char d[120];

        uint8_t dio0 = (uint8_t)HAL_GPIO_ReadPin(LORA_DIO0_PORT, LORA_DIO0_PIN);
        uint8_t irq  = LoRa_ReadReg(REG_IRQ_FLAGS);
        uint8_t op   = LoRa_ReadReg(REG_OPMODE);
        uint8_t rssi = LoRa_ReadReg(REG_PKT_RSSI_VALUE);

        snprintf(d, sizeof(d),
                 "[LORA RX] DIO0=%u IRQ=0x%02X OP=0x%02X RSSI_REG=0x%02X",
                 dio0, irq, op, rssi);
        uart_print_now(d);

        /*
         * If OpMode accidentally changes, force back to RX continuous.
         */
        if (op != 0x85)
        {
            uart_print_now("[LORA RX] WARNING: OpMode not RX continuous — restoring 0x85");
            LoRa_EnterRxContinuous();
        }
    }
#endif

    if (s_wirelessDataValid)
    {
        (void)LoRa_IsWirelessDataValid();
    }

    if (s_pairingMode && (now >= s_pairingDeadline))
    {
        s_pairingMode = false;
        uart_print_now("[LORA RX] pairing window expired — returning RX continuous");

        LoRa_WriteReg(REG_IRQ_FLAGS, 0xFF);
        LoRa_EnterRxContinuous();
    }

    handle_stale_periodics(now);
    maybe_print_stats(now);

    int16_t rssi = 0;
    uint8_t len = LoRa_PollPacket(s_rxBuf, &rssi);

    if (len == 0u)
    {
        log_flush();
        return;
    }

    s_rxBuf[len] = '\0';
    s_rxPacketCount++;

    if (len < MAX_PACKET_LEN)
    {
        memcpy((void *)g_lastRxPacket, s_rxBuf, (size_t)(len + 1u));
    }

    ParsedPacket_t p;
    bool ok = LoRa_ParsePacket((const char *)s_rxBuf, &p);

    log_defer("[LORA RX] rx#%lu rssi=%d state=%s raw=\"%s\"",
              (unsigned long)s_rxPacketCount,
              (int)rssi,
              LoRa_GetStateString(),
              (char *)s_rxBuf);

    if (!ok)
    {
        log_defer("[LORA RX] parse failed — ignored");
        log_flush();
        return;
    }

    switch (p.type)
    {
    case PKT_TYPE_HELLO:
    {
        if (s_pairingMode)
        {
            discovery_add_or_update(p.did, rssi);
            send_ack(p.did);

            log_defer("[LORA RX] DISCOVERED HELLO DID=%08lX RSSI=%d",
                      (unsigned long)p.did,
                      (int)rssi);

            g_loraNewPacketFlag = true;
            break;
        }

        if (should_allow(p.did))
        {
            s_lastPeerTick       = now;
            s_wirelessDataValid  = false;
            s_seqInitialized     = false;
            s_lastSeq            = 0;

            send_ack(p.did);

            set_state(LORA_STATE_CONNECTED);

            log_defer("[LORA RX] HELLO from paired DID %08lX -> ACK CONNECTED",
                      (unsigned long)p.did);

            LED_SetIntent(LED_COLOR_GREEN, LED_MODE_BLINK, 300);
        }
        else
        {
            send_reject(p.did);

            log_defer("[LORA RX] HELLO from unpaired DID %08lX -> REJECT",
                      (unsigned long)p.did);
        }
    }
    break;

    case PKT_TYPE_TANKLEVEL:
    {
        if (s_pairingMode)
        {
            discovery_add_or_update(p.did, rssi);
            send_ack(p.did);

            log_defer("[LORA RX] DISCOVERED TL DID=%08lX RSSI=%d",
                      (unsigned long)p.did,
                      (int)rssi);

            g_loraNewPacketFlag = true;
            break;
        }

        if (!should_allow(p.did))
        {
            send_reject(p.did);

            log_defer("[LORA RX] TL from unpaired DID %08lX -> REJECT",
                      (unsigned long)p.did);
            break;
        }

        bool fresh = validate_sequence(p.seq);

        /*
         * ACK duplicate also.
         * This helps transmitter stop retrying after reconnection.
         */
        send_ack(p.did);

        if (fresh)
        {
            accept_data(p.level, p.well_dry, p.did);

            set_state(LORA_STATE_CONNECTED);
            s_lastPeerTick = now;

            LED_SetIntent(LED_COLOR_GREEN, LED_MODE_STEADY, 1);

            log_defer("[LORA RX] TL=%u%% WD=%u seq=%08lX DID=%08lX -> ACCEPTED",
                      (unsigned)p.level,
                      (unsigned)p.well_dry,
                      (unsigned long)p.seq,
                      (unsigned long)p.did);
        }
        else
        {
            s_lastPeerTick = now;

            log_defer("[LORA RX] TL duplicate/out-of-order seq=%08lX -> re-ACKed",
                      (unsigned long)p.seq);
        }
    }
    break;

        case PKT_TYPE_PING:
        {
            if (!should_allow(p.did))
            {
                send_reject(p.did);

                log_defer("[LORA RX] PING from unpaired DID %08lX -> REJECT",
                          (unsigned long)p.did);
                break;
            }

            send_pong(p.did, p.seq);

            s_lastPeerTick = now;

            if (s_state != LORA_STATE_CONNECTED)
            {
                set_state(LORA_STATE_CONNECTED);
            }

            log_defer("[LORA RX] PING from %08lX -> PONG seq=%08lX",
                      (unsigned long)p.did,
                      (unsigned long)p.seq);
        }
        break;

        case PKT_TYPE_BYE:
        {
            log_defer("[LORA RX] BYE from %08lX -> STALE",
                      (unsigned long)p.did);

            s_wirelessDataValid = false;
            set_state(LORA_STATE_STALE);

            LED_SetIntent(LED_COLOR_RED, LED_MODE_BLINK, 500);
        }
        break;

        default:
        {
            log_defer("[LORA RX] unexpected packet type %d from DID=%08lX",
                      (int)p.type,
                      (unsigned long)p.did);
        }
        break;
    }

    log_flush();
}
